OptiSession/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

functions
{
    outletUniformity
    {
        type        surfaceFieldValue;
        libs        (fieldFunctionObjects);
        fields      (U);
        writeFields no;
        log         true;
        regionType  patch;
        name        outlet;
        operation   uniformity;
    }

    pDrop
    {
        type        surfaceFieldValue;
        libs        (fieldFunctionObjects);
        fields      (p);
        writeFields no;
        regionType  patch;
        name        inlet;
        operation   areaAverage;
    }
    //#include "derivedFields"
    //#include "sampling"
    // #include "samplingDebug"
}


// ************************************************************************* //
